{
	
	"_meta": {
		"maxChars": {
			"title": 150,			
			"hangarButtonText1": 7,
			"hangarButtonText2": 7,
			"hangarButtonText3": 7,
			"shootTutorialText0": 70,
			"shootTutorialText1": 70,
			"shootTutorialText2": 70,
			"shootTutorialText3": 70,
			"shootTutorialText4": 70,
			"shootTutorialText5": 70,
			"shootTutorialText6": 70,
			"shootTutorialText7": 70,
			"shootTutorialText7.5": 70,
			"shootTutorialText8": 70,
			"shootTutorialText8.5": 70,
			"sortTutorialText0": 140,
			"sortTutorialText1": 140,
			"mainText0": 185,
			"mainText1": 185,
			"mainText2": 185,
			"mainText3": 185,
			"mainText4": 185,
			"mainText5": 185,
			"mainText6": 185,
			"mainText7": 185,
			"mainText8": 185,
			"mainText9": 185,
			"mainText10": 185,
			"mainText12": 185,
			"mainText13": 185,
			"mainText14": 185,
			"mainText16": 185,
			"mainText17": 185,
			"mainText18": 185,
			"mainText19": 185,
			"mainText22": 185,
			"mainText23": 185,
			"mainText24": 185,
			"mainText25": 185,	
			"mainText27": 185,
			"mainText28": 185,
			"mainText30": 185,
			"mainText32": 185,
			"mainText33": 185,
			"mainText34": 185,
			"mainText35": 185,
            "mainText36": 185,
			"mainText37": 185,			
			"mainText39": 185
		}
    },
	"en": {
		"title":"Earth Defender: Math to the Rescue",		
		"hangarButtonText1":"NEXT",
		"hangarButtonText2":"READY!",
        "hangarButtonText3":"YES",
		"shootTutorialText0":"USE W A S D OR THE ARROW KEYS ON YOUR KEYBOARD TO MOVE YOUR SHIP",
		"shootTutorialText1":"USE THE LEFT MOUSE BUTTON TO SEND OUT CODE PULSES",
		"shootTutorialText2":"WHEN YOUR PULSES ARE ALL GONE, YOU NEED TO RECHARGE THE GENERATOR",
		"shootTutorialText3":"YOU START WITH 3 LIVES. IF YOU LOSE THEM YOU NEED TO START AGAIN",
		"shootTutorialText4":"YOU LOSE A LIFE IF YOU CRASH OR MISS WITH A PULSE, SO BE CAREFUL",
		"shootTutorialText5":"THE NUMEROID SHIPS WILL APPEAR FROM THE RIGHT OF THE SCREEN",
		"shootTutorialText6":"GET READY CADET, THE STAGE STARTS In 3",
		"shootTutorialText7":"GET READY CADET, THE STAGE STARTS IN 2",
		"shootTutorialText7.5":"2",
		"shootTutorialText8":"GET READY CADET, THE STAGE STARTS IN 1",
		"shootTutorialText8.5":"1",
		"sortTutorialText0":"OUR SHIPS WAITING FOR TARGETS ARE BELOW, CHECK WHAT THE SELECTED SHIP NEEDS THEN CLICK ON THE NUMEROID SHIPS TO ASSIGN THEM TO It.",
		"sortTutorialText1":"EACH SHIP WILL LAUNCH WHEN It HAS ALL It'S TARGETS AND YOU CAN THEN MOVE ONTO THE NEXT ONE. THINK CAREFULLY, CADET",
		"mainText0":"AH, OUR LATEST CADET HAS ARRIVED. WELCOME. NO DOUBT YOU ARE AWARE OF OUR CURRENT SITUATION, BUT PLEASE ALLOW ME TO REFRESH YOUR MEMORY JUST IN CASE.",
		"mainText1":"OUR PLANET IS UNDER ATTACK BY INVADERS FROM ANOTHER STAR. THEY CALL THEMSELVES NUMEROIDS. OUR PREVIOUS RELATIONS WITH THEM HAVE ALWAYS BEEN PEACEFUL, UNTIL NOW.",
		"mainText2":"WE HAVE NOT BEEN ABLE TO COMMUNICATE WITH THEM AND DO NOT KNOW WHY THEY ARE INVADING, BUT WE THINK A TERRIBLE DISASTER MAY HAVE HIT THEIR HOME SYSTEM AND THEY ARE FLEEING IN PANIC.",
		"mainText3":"THE INVADERS WE HAVE ENCOUNTERED SO FAR REPRESENT ONLY A SMALL PART OF THEIR NUMBERS. THIS GIVES uS A CHANCE TO AVOID A FULL SCALE WAR BETWEEN OUR SPECIES.",
		"mainText4":"IF WE CAN SOMEHOW REPEL THEIR ATTACK WITHOUT CAUSING THEM HARM THEY WILL SEE THAT WE WANT TO BE FRIENDS, BUT ALSO THAT WE CAN DEFEND OURSELVES IF WE HAVE TO.",
		"mainText5":"WE HAVE FOUND A WAY TO DO JUST THAT THROUGH MATH! WE HAVE CRACKED A CODE THAT WILL LET uS TAKE DOWN THEIR SHIELDS WITHOUT DAMAGING THEIR SHIPS. WE HOPE THEY WILL THEN RUN AWAY.",
		"mainText6":"BUT THERE IS A CATCH. IN ORDER TO BYPASS THEIR DEFENCES, THE CODE WILL NEED TO BE SENT AT VERY CLOSE RANGE THROUGH AN ENERGY PULSE. WE HAVE UPGRADED OUR SHIPS TO SEND OUT THE PULSE.",
		"mainText7":"LET'S CHARGE YOUR PULSE GENERATOR. EACH CODE PULSE CONTAINS TWO ALGORITHMS, AND YOUR GENERATOR CAN HOLD FIVE PULSES BEFORE It NEEDS RECHARGING.",
		"mainText8":"HMMM. THAT REALLY IS A PRETTY SLOW PROCESS. IF WE'RE GOING TO SAVE THE EARTH, WE'LL NEED TO BE A BIT QUICKER. I'LL START WORKING ON UPGRADES WHEN WE'VE FINISHED HERE.",
		"mainText9":"NOW WE NEED YOU TO PILOT YOUR SHIP AND DELIVER THE PULSES. AFTER EACH MISSION WE WILL ATTEMPT TO MAKE FURTHER UPGRADES WITH YOUR HELP.",
		"mainText10":"OH! ANOTHER ATTACK IS INCOMING. QUICKLY NOW, GET TO YOUR SHIP. BE CAREFUL OUT THERE, AND REMEMBER NOT TO ATTACK INVADERS THAT ARE RETREATING. GOOD LUCK!",
		"mainText10.5":"UNLUCKY CADET. WE'VE RECHARGED AND REPAIRED YOUR SHIP. TRY NOT TO CRASH INTO THE NUMEROIDS AND DON'T WASTE YOUR PULSES. READY TO TRY AGAIN?",
		"mainText12":"CONGRATULATIONS, YOU FOUGHT OFF THE INVADERS WITHOUT HARMING THEM. A VERY SUCCESSFUL MISSION! WE'VE ANALYZED YOUR BATTLE DATA AND FOUND SOMETHING INTERESTING.",
		"mainText13":"AS YOU KNOW, CHARGING THE PULSE GENERATOR TAKES TIME. WE WORKED ON THE PROBLEM AND WE'VE FOUND A WAY TO SPEED THINGS UP. FIRST LET'S DO It THE OLD WAY.",	
		"mainText14":"THIS METHOD IS CALLED REPEATED ADDITION, It GET'S THE JOB DONE BUT It CAN BE SLOW WHEN COUNTING LOTS OF THINGS. HOWEVER, THERE IS ANOTHER WAY. MULTIPLICATION!",
		"mainText15":"USING MULTIPLICATION WE CAN PROGRAM YOUR CHARGING MODULE TO CHARGE ITSELF. INCREDIBLE, YES? WE FIRST NEED TO TELL THE MODULE THE SIZE OF EACH CHARGE, WHICH IS 2.",
		"mainText16":"WE THEN NEED TO TELL THE MODULE HOW MANY CHARGES TO APPLY. HERE'S THE CHARGES YOU APPLIED LAST TIME, CAN YOU COUNT TO SEE HOW MANY YOU NEEDED TO APPLY?",
		"mainText17":"THAT'S CORRECT. WE APPLY A CHARGE WITH A SIZE OF 2, AND WE APPLY It 5 TIMES. WE SAY THAT aS 5 TIMES 2. IN MATH, WE USE THE SYMBOL X TO REPRESENT TIMES. SO WE WRITE It aS 5 X 2.",
		"mainText18":"SO WE CAN CHANGE 2 + 2 + 2 + 2 + 2 TO 5 X 2, AND It WORKS WITH OTHER NUMBERS TOO. 3 + 3 + 3 + 3 WOULD BE 4 X 3. NOW LET'S TRY CHARGING YOUR SHIP WITH MULTIPLICATION.",
		"mainText19":"YES, THAT'S MUCH FASTER, AND JUST IN TIME TOO. ANOTHER NUMEROID WAVE IS INCOMING. QUICKLY, TO YOUR SHIP!",
		"mainText21":"EXCELLENT, ANOTHER SUCCESS. I'M AFRAID WE DON'T HAVE TIME TO CELEBRATE THOUGH. OUR LONG RANGE SENSORS HAVE SHOWN uS SOMETHING WORRYING. THE NUMEROIDS ARE CHANGING TACTICS!",
        "mainText22":"WE'RE NOW SEEING THE NUMEROIDS USING DIFFERENT SHIELD CONFIGURATIONS. EACH NEW SHIELD TYPE WILL REQUIRE A DIFFERENT CODE TO DEFEAT It, BUT MULTIPLICATION ONLY WORKS FOR EQUAL GROUPS.",
		"mainText23":"SO ALTHOUGH WE CAN USE MULTIPLICATION TO CHANGE 3 + 3 + 3 + 3 INTO 4 X 3, THIS WON'T WORK WITH 3 + 4 + 2 + 1. WE CAN'T USE MULTIPLICATION TO CHARGE YOUR SHIP WITH DIFFERENT CODES.",
		"mainText24":"IN ORDER TO DEAL WITH THESE TACTICS, WE'LL NEED TO GROUP EACH TYPE OF NUMEROID TOGETHER, AND THEN ASSIGN THAT GROUP TO ONE OF OUR SHIPS WITH THE MATCHING CODE.",
		"mainText25":"BUT OUR ANALYSTS ARE OVERWHELMED. THERE'S SIMPLY TOO MUCH DATA. CAN YOU HELP uS SORT THE TARGETS AND ASSIGN THEM TO THE CORRECT SHIP?",
		"mainText27":"BRILLIANT! WE HAVE THE SITUATION UNDER CONTROL NOW. WE'VE ASSIGNED YOU A SET OF TARGETS. REMEMBER, ONLY ENGAGE THE NUMEROID SHIPS WITH THE SHIELD CONFIGURATION YOU'RE ASSSIGNED.",
        "mainText28":"WE'RE IN A CRITICAL STAGE OF THE DEFENCE OF EARTH. WE CANNOT AFFORD MISTAKES. IF YOU MAKE TOO MANY WE MAY NEED TO WITHDRAW FROM THE BATTLE AND TRY AGAIN.",
        "mainText30":"AMAZING JOB. BUT THERE'S NO TIME TO RELAX. ANOTHER WAVE IS ALREADY APPROACHING WITH NEW SHIELD CONFIGURATIONS. GOOD LUCK, CADET!",
        "mainText32":"CADET, YOUR WORK SO FAR HAS BEEN TRULY EXCEPTIONAL. IN HONOUR OF YOUR DEDICATION WE'RE HEREBY PROMOTING YOU TO PILOT 1ST CLASS. CONGRATULATIONS.",
        "mainText33":"PILOT, WE'VE JUST RECEIVED IMPORTANT INFORMATION FROM DEEP SPACE TRACKING. WE'VE DISCOVERED THE NUMEROID MOTHERSHIP, THE CRAFT THAT IS LEADING THE INVASION OF OUR SYSTEM.",
        "mainText34":"THIS IS THE BIG ONE. IF WE CAN DEFEND AGAINST THE MOTHERSHIP, WE WILL HAVE SAVED THE EARTH. BUT It WON'T BE EASY.",		
		"mainText35":"OUR ANALYSIS HAS SHOWN THAT THE MOTHERSHIP USES SEVERAL DIFFERENT OVERLAPPING SHIELD CONFIGURATIONS. OUR CURRENT SHIPS CAN'T HANDLE THIS TYPE OF CHALLENGE.",
        "mainText36":"THANKFULLY, OUR NEW PROTOTYPE SHIP HAS AN EXPERIMENTAL CODE CHARGER THAT ADAPTS TO ANY SHIELD CONFIGURATION, BUT WE NEED YOU TO RE-CALIBRATE It AT EACH STAGE OF THE DEFENSE.",
        "mainText37":"I'M SORRY TO THROW YOU IN AT THE DEEP END LIKE THIS, PILOT. BUT I BELIEVE YOU HAVE THE SKILLS FOR THIS VITAL TASK. THE MOTHERSHIP IS ALMOST HERE, IT'S TIME TO GO.",
        "mainText39":"YOU'VE DONE It! THE NUMEROIDS ARE WITHDRAWING. THE EARTH IS SAVED! ALL THANKS TO YOU, AND THE AWESOME POWER OF MULTIPLICATION!"
	}	
}